ltowarek/esp-opentelemetry-cpp/examples/propagation/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MODE_OCT=y

# OpenTelemetry tracing + its protobuf/Abseil dependencies blow past the
# stock "single app large" 1.5 MB factory partition. Grow flash to 4 MB
# and switch to a custom layout with a ~3.25 MB factory slot.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_ESP_OPENTELEMETRY_TRACING_ENABLED=y
CONFIG_ESP_OPENTELEMETRY_EXPORTER_OTLP_ENDPOINT=""
CONFIG_ESP_OPENTELEMETRY_SERVICE_NAME="propagation-example"

CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=32768

CONFIG_WIFI_SSID=""
CONFIG_WIFI_PASSWORD=""
CONFIG_TARGET_URL=""
